"""
Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
круглой грядке, причем кусты высажены только по окружности. Таким образом, у
каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
выросло различное число ягод – на i-ом кусте выросло ai ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники.
Эта система состоит из управляющего модуля и нескольких собирающих модулей.
Собирающий модуль за один заход, находясь непосредственно перед некоторым
кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может
собрать за один заход собирающий модуль, находясь перед некоторым кустом
заданной во входном файле грядки.
4 -> 1 2 3 4
9
"""
from random import randint

number_of_bushes = int(input('Введите количество кустов: '))
crop_productivity_list = [randint(1,51) for i in range(number_of_bushes)]
print('Список урожайности кустов: ')
print(*crop_productivity_list)

max_crop = crop_productivity_list[-2]+crop_productivity_list[-1]+crop_productivity_list[0]
current_crop = max_crop
for i in range(-2,number_of_bushes-3):
    current_crop -= crop_productivity_list[i]
    current_crop += crop_productivity_list[i+3]
    if current_crop > max_crop:
        max_crop = current_crop
print(f'Максимальный сбор за один заход: {max_crop} ягод(а)')




